[
  {
    "name": "Rick",
    "image": "Rick_Sanchez.png",
    "description": "Rick Sanchez is the co-eponymous main character and leading protagonist of the show. He is a genius scientist whose alcoholism and reckless, nihilistic behavior are a source of concern for his daughter's family, as well as the safety of their son, Morty. He is voiced by Justin Roiland.",
    "age": "70",
    "status": "alive",
    "job": [
      "Scientist",
      "Inventor",
      "Arms salesman",
      "Store Owner (briefly)"
    ],
    "placeOfOrigin": "Earth (Dimension C-137)",
    "id": "101"
  },
  {
    "name": "Morty",
    "image": "Morty_Smith.jpg",
    "description": "Mortimer \"Morty\" Smith Sr. is one of the two eponymous main protagonists in Rick and Morty. He is the grandson of Rick and is often forced to tag along on his various misadventures. Morty attends Harry Herpson High School along with his sister, Summer.",
    "age": "14",
    "status": "alive",
    "job": ["Student at Harry Herpson High School"],
    "placeOfOrigin": "Earth (Dimension C-137)",
    "id": "102"
  },
  {
    "name": "Jerry",
    "image": "Jerry_Smith.png",
    "description": "Jerry Smith is the husband of Beth Smith, the father of Summer Smith and Morty Smith, and the son-in-law of Rick Sanchez and Mrs. Sanchez/Diane Sanchez, he currently acts as the father, and the son-in-law, of the Morty Smith and Rick Sanchez from Dimension C-137, respectively. He shares the same history as his C-137 counterpart until the Cronenberg disaster, where it was averted in his dimension.",
    "age": "34",
    "status": "alive",
    "job": [
      "Advertising agent (fired)",
      "Unknown assigned Galactic Federation employment (laid off after Federation collapse)"
    ],
    "placeOfOrigin": "Earth (Dimension C-137)",
    "id": "103"
  },
  {
    "name": "Beth",
    "image": "Beth_Smith.png",
    "description": "Beth Smith (née Sanchez) is the daughter of Rick Sanchez and Mrs. Sanchez/Diane Sanchez, the wife of Jerry Smith, and the mother of Summer Smith and Morty Smith. She currently acts as the mother, and the daughter, of the Morty Smith and Rick Sanchez from Dimension C-137, respectively. She is currently employed as a veterinary surgeon at St. Equis Hospital.",
    "age": "34",
    "status": "alive",
    "job": ["Horse surgeon at St. Equis Hospital"],
    "placeOfOrigin": "Earth (Dimension C-137)",
    "id": "104"
  },
  {
    "name": "Summer",
    "image": "Summer_Smith.jpg",
    "description": "Summer Smith is the daughter of Jerry Smith and Beth Smith, the older sister of Morty Smith, and the granddaughter of Rick Sanchez and Mrs. Sanchez/Diane Sanchez, she currently acts as the older sister, and the granddaughter, of the Morty Smith and Rick Sanchez from Dimension C-137. She is the only other member of the Smith Family to be aware of that fact.",
    "age": "17",
    "status": "alive",
    "job": ["Student at Harry Herpson High School"],
    "placeOfOrigin": "Earth (Dimension C-137)",
    "id": "105"
  },
  {
    "name": "Birdperson",
    "image": "Birdperson.png",
    "description": "Birdpeson is an old friend of Rick's and has seemingly known Morty since he was a baby. He attends Rick's party looking for a new mate after ending his soul-bond with his previous spirit-partner.",
    "age": "Unknown",
    "status": "alive",
    "job": ["Unknown"],
    "placeOfOrigin": "Bird World, 20 light-years away from Earth",
    "id": "106"
  },
  {
    "name": "Davin",
    "image": "Davin.png",
    "description": "Davin was Beth's coworker at St. Equis Hospital. Davin is in love with Beth and he constantly hits on her and tries to seduce her and win her over. Because of this, Jerry is extremely jealous of him. Beth denies having any feelings for him, which she most likely doesn't, but Jerry does not trust her around him and absolutely hates him with every fiber in his being.",
    "age": "Unknown, possibly late 20's - early 30's",
    "status": "Deceased",
    "job": ["Horse surgeon"],
    "placeOfOrigin": "Earth (Dimension C-137)",
    "id": "107"
  },
  {
    "name": "Jessica",
    "image": "Jessica.png",
    "description": "Jessica is a student at Harry Herpson High School. She is a popular girl in Morty's math class who he desires to be with romantically and often has surreal daydreams about, almost exclusively sexual in nature. Much to Morty's dismay she is already in a relationship with Brad, whom she frequently experiences difficulties with. She is voiced by Kari Wahlgren.",
    "age": "14",
    "status": "alive",
    "job": ["Student at Harry Herpson High School"],
    "placeOfOrigin": "Earth (Dimension C-137)",
    "id": "108"
  },
  {
    "name": "Mr. Goldenfold",
    "image": "mr_goldenfold.png",
    "description": "Mr. Goldenfold is Morty's eccentric math teacher. He is voiced by Brandon Johnson.",
    "age": "Unknown, possibly late 40's - early 50's",
    "status": "alive",
    "job": ["Teacher at Harry Herpson High School"],
    "placeOfOrigin": "Earth (Dimension C-137)",
    "id": "109"
  },
  {
    "name": "Principal Vagina",
    "image": "Principal_Vagina.png",
    "description": "Principal Gene Vagina is the principal of Harry Herpson High School. He is voiced by Phil Hendrie.",
    "age": "Unknown, possibly late 60's - early 70's",
    "status": "alive",
    "job": ["Principal of Harry Herpson High School"],
    "placeOfOrigin": "Earth (Dimension C-137)",
    "id": "110"
  },
  {
    "name": "Squanchy",
    "image": "Squanchy_.png",
    "description": "Squanchy is a cat-like anthropomorphic creature that was invited to Rick and Summer's party in \"Ricksy Business\". He is a recurring character in Rick and Morty, and very good friends with Rick, sharing his love for alcohol. Morty and Jessica catch Squanchy engaging in auto-erotic asphyxiation masturbation in Morty's garage. He refers to this as \"squanching\".",
    "age": "Unknown",
    "status": "dead",
    "job": ["Unknown"],
    "placeOfOrigin": "Earth (Dimension C-137)",
    "id": "111"
  },
  {
    "name": "Mr. Meeseeks",
    "image": "Meeseeks.png",
    "description": "Mr. Meeseeks (voiced by Justin Roiland) is the name of all the Meeseeks summoned by activating a Meeseeks Box. The Meeseeks appear in the fifth episode of the first season, \"Meeseeks and Destroy\". They are known to inhabit planets across the universe.",
    "age": "Alive until they finish their mission",
    "status": "Extant (regularly dying)",
    "job": ["Whatever is asked of them"],
    "placeOfOrigin": "Meeseeks Box",
    "id": "112"
  },
  {
    "name": "King Flippy Nips",
    "image": "King_Flippynips.png",
    "description": "King Flippy Nips is the ruler of Pluto. He first appeared in \"Something Ricked This Way Comes\" as the secondary main antagonist.",
    "age": "Unknown",
    "status": "alive",
    "job": ["King of Pluto"],
    "placeOfOrigin": "Pluto",
    "id": "113"
  },
  {
    "name": "Noob-Noob",
    "image": "noob_noob.jpg",
    "description": "Noob-Noob is a small masked character who made his first appearance in \"Vindicators 3: The Return of Worldender.\" He acts as a janitor for the Vindicators, and is generally underappreciated. Noob-Noob appears to be ready to graduate to a full Vindicator, but is forced to remain behind after Rick gets drunk, passes out, and defecates all over the ship's holo-table. Nevertheless, he seems to be the only member of the Vindicators that enjoys Rick's humor, and as Rick later reveals to Morty (while drunk), Noob-Noob is the only member of the Vindicators that Rick values, even more than Morty, to which Morty replies with \"Motherf *** er.\" . At the end of the episode, Logic raps about how underappreciated Noob-Noob is, although Rick doesn't remember him. ",
    "age": "Unknown",
    "status": "alive",
    "job": ["Intern, Janitor"],
    "placeOfOrigin": "Unknown",
    "id": "114"
  },
  {
    "name": "Mr. Poopybutthole",
    "image": "Mr_poopy_butthole.png",
    "description": "Mr. Poopybutthole is a long-time family friend of the Smiths. Rick clearly considers him to have long been a dependable person, although it's uncertain how long they've known each other. He made his first appearance in the episode Total Rickall. He is voiced by Justin Roiland.",
    "age": "Unknown, long-time family friend of the Smiths",
    "status": "alive",
    "job": ["Keep the Smith family in a good mood even in the darkest of times"],
    "placeOfOrigin": "Earth (Dimension C-137)",
    "id": "115"
  }
]
